package bg.uni_svishtov.bi2017.helloarrays;

public class Main {

    public static void main(String[] args) {
	    int[] a; // По този начин се дефинира масив в Java...
                 // Но дефинирането на масив се извършва без
                 // да се запазва място за данните в паметта...
                 // За да може да се използва, това място в паметта трябва да
                 // бъде резервирано.

        a = new int[50];  // Операторът new създава масив от 50 int елемента.


        // Създаването на масив на две стъпки е оправдано вероятно само за много
        // големи масиви, при които искаме да отложим резервирането на паметта
        // до последния възможен момент.
        // В останалите ситуации ние можем да ги изпълним заедно по следния начин:
        int[] b = new int[50];


        System.out.println(a[0]);  //Така се извежда първият елемент от масива.
                                   //Номерата на позициите в масива започват от 0.
                                    //Ние наричаме тези номера "индекси".

        a[5] = 7;
                        // Това слага стойност 7 в елемент с индекс 5.
                        // Шестият елемент на масива има индекс 5.

        // По този начин извеждаме броя на елементите в масива.
        System.out.println(a.length);

        /*
         * МНОГО ВАЖНО!!!!!!
         * Какво се случва когато присвояваме една променлива на масив на друга.
         * Копират ли се стойностите от един масив в друг при това присвояване???
         */

        int[] c = a;

        System.out.println(a[5]);
        System.out.println(c[5]);

        a[5] = 111;

        System.out.println(a[5]);
        System.out.println(c[5]);


        // При присвояване на променливи от тип "масив" и двете променливи
        // сочат към един и същ масив в паметта. Така че промяната на елемент
        // с даден индекс чрез едната променлива води до автоматична промяна на
        // елемента със същия индекс при другата променлива.
        // Масивът в паметта на компютъра просото е един.


        //Когато наистина се налага копиране на стойностите на един масив се използва
        //методът clone

        // a.clone() копира съдържанието на масива в нова област от паметта
        // и връща референция (адрес в паметта, който сочи началото на масива).
        // Ние присвояваме тази референция на променливата c.
        // Копирането на големи масиви е скъпа операция и трябва да се избягва
        // при замислянето на изчислителни алгоритми.
        c = a.clone();
        a[12]=55;
        System.out.println(c[12]);

        int[][] multidimensional = new int[20][30];

        // При създаването си, масивът се запълва с нули
        System.out.println(multidimensional[3][2]);



    }
}
